Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotKeepWallJoinToRoofError Property
 Can't keep wall and [target] joined
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotKeepWallJoinToRoofError { get; }
Public Shared ReadOnly Property CannotKeepWallJoinToRoofError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotKeepWallJoinToRoofError {
	FailureDefinitionId^ get ();
}
static member CannotKeepWallJoinToRoofError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace